client/testresponse.xsl

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:tns="https://sosdirectws.sos.state.tx.us/enotary/" xmlns:s1="http://sos.state.tx.us/eNotary/">
    <soap:Body>
        <QueueApplications xmlns="https://sosdirectws.sos.state.tx.us/enotary/">
        <objClientData>
            <s1:Client xmlns:s1="http://sos.state.tx.us/eNotary/">
                <s1:ClientId>550398515</s1:ClientId>
                <s1:Password>Texas2010</s1:Password>
                <s1:EnvelopeID>100000000</s1:EnvelopeID>
                <s1:PaymentType>5</s1:PaymentType>
                <s1:CardType>0</s1:CardType>
                <s1:CardNumber>0</s1:CardNumber>
                <s1:ExpireYear>0</s1:ExpireYear>
                <s1:ExpireMonth>0</s1:ExpireMonth>
                <s1:RunMode>2</s1:RunMode>
                <s1:BusinessName>Insurors Indemnity Companies</s1:BusinessName>
                <s1:FirstName>Tammy</s1:FirstName><s1:MiddleName></s1:MiddleName>
                <s1:LastName>Tieperman</s1:LastName>
                <s1:NameSuffix></s1:NameSuffix>
                <s1:AddressLine1>PO Box 2683</s1:AddressLine1>
                <s1:AddressLine2></s1:AddressLine2>
                <s1:City>Waco</s1:City>
                <s1:StateCode>TX</s1:StateCode>
                <s1:PostalCode>76702</s1:PostalCode>
                <s1:PostalCodeExtension>2683</s1:PostalCodeExtension>
                <s1:Country>USA</s1:Country>
                <s1:PhoneNumber>2547593727</s1:PhoneNumber>
                <s1:PhoneExtension></s1:PhoneExtension>
                <s1:FaxNumber></s1:FaxNumber>
                <s1:EMail>ttieperman@insurorsindemnity.com</s1:EMail>
            </s1:Client>
        </objClientData>
        <objNotaryData>
            <s1:NotaryApplications xmlns:s1="http://sos.state.tx.us/eNotary/">
                <s1:clsNotary>
                    <s1:ApplicationID>1000000</s1:ApplicationID>
                    <s1:FirstName>Greg</s1:FirstName>
                    <s1:MiddleName></s1:MiddleName>
                    <s1:LastName>Drake</s1:LastName>
                    <s1:NameSuffix></s1:NameSuffix>
                    <s1:DateOfBirth>10/20/2015</s1:DateOfBirth>
                    <s1:SocialSecurityNumber>504444560</s1:SocialSecurityNumber>
                    <s1:DriverLicenseState>TX</s1:DriverLicenseState>
                    <s1:DriverLicenseNumber>44034503</s1:DriverLicenseNumber>
                    <s1:ResidenceAddress>34 Russel</s1:ResidenceAddress>
                    <s1:ResidenceCity>Waco</s1:ResidenceCity>
                    <s1:ResidenceStateCode>TX</s1:ResidenceStateCode>
                    <s1:ResidencePostalCode>65604</s1:ResidencePostalCode>
                    <s1:ResidenceCounty>McLennan</s1:ResidenceCounty>
                    <s1:AgencyName>Insurors Indemnity Managed General Agency</s1:AgencyName>
                    <s1:SuretyCompany>Insurors Indemnity Company</s1:SuretyCompany>
                    <s1:EMailAddress>gdrake@insurorsindemnity.com</s1:EMailAddress>
                    <s1:TexasResidentIndicator>Y</s1:TexasResidentIndicator>
                    <s1:FelonyConvictionIndicator>N</s1:FelonyConvictionIndicator>
                    <s1:ApplicationImage></s1:ApplicationImage>
                </s1:clsNotary>
            </s1:NotaryApplications>
        </objNotaryData>
    </QueueApplications>
    </soap:Body>
</soap:Envelope>